<p><strong>Help: <span style="text-decoration: underline;"><a href="http://xmodules.jubile.fr/modules/slider/admin/%3C%7B$xoops_url%7D%3E/modules/slider/admin/index.php" title="Back to the administration of slider - Slides management">slider - Slides management </a></span></strong></p>
<p><strong>Description</strong></p>
<p>Ce module permet de g&eacute;rer les slides de la page d'accueil des th&egrave;mes utilis&eacute;s<br /> Il ne fonctionne qu'avec les th&egrave;mes de type "xbootstrap".<br /> Le fichier "<strong>tpl/slider.tpl</strong>" doit exister.<br /> Il sera peut &ecirc;tre n&eacute;c&eacute;ssaire de la mettre en &eacute;criture pour permettre sa modification.</p>
<p><strong>Fonctionalit&eacute;s</strong> :</p>
<ul type="disc"><li>Ajout, Supprimer de slides &agrave; la page d'accueil</li><li>Activation, d&eacute;sactivation des slide, sans supression</li><li>D&eacute;fini le type d'affichage: avec ou sans p&eacute;riode d'affichage</li><li>D&eacute;finition de l'ordre d'affichage des slides</li><li>D&eacute;finition d'une p&eacute;riode d'affichage pour anticiper un &eacute;v&eacute;nnement</li></ul><p>&nbsp;</p>
<p><strong>Install/uninstall</strong></p>
<p>Aucune mesure particuli&egrave;re n'est n&eacute;cessaire, suivez le processus d'installation standard et extrayez le dossier du curseur dans le r&eacute;pertoire ../modules. Installez le module via Admin =&gt; Module syst&egrave;me =&gt; Modules. <br /> Des instructions d&eacute;taill&eacute;es sur l'installation des modules sont disponibles dans le <span style="text-decoration: underline;"><a href="http://goo.gl/adT2i">XOOPS Operations Manual</a></span></p>
<p>&nbsp;</p>
<p><strong>Carat&eacute;ristiques</strong></p>
<p>Le module &laquo;&nbsp;slider&nbsp;&raquo; continue d&rsquo;&eacute;voluer. Pour cette raison, j'invite tous les d&eacute;veloppeurs &agrave; signaler et envoyer sur le SVN tout changement ou ajout &agrave; ce module, afin que nous puissions contribuer conjointement au d&eacute;veloppement</p>
<p><strong>Tutorial</strong></p>
<p>Une fois install&eacute;, actions &agrave; effectuer :</p>
<ul type="disc"><li>Installation standard&nbsp; de module</li><li>Ajouter des slides au th&egrave;mes utilis&eacute;s (voir "Ajout d'un nouveau slide)""</li><li>Activer le block du module, peu importe sa place il restera invisible<br /> <strong>Important</strong> : l'option "Afficher le block" du block Permet de lister les slides s&eacute;lectionn&eacute;s<br /> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &agrave; utiliser en mode d&eacute;bogage uniquement<br /> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; laisser la sur "Non" en production</li></ul><p><strong>Ajout d'un nouveau slide</strong></p>
<p><strong>Nom court</strong> (sld_short_name): Expression pour affichage dans l&rsquo;admin. Utilis&eacute; pour les tris, mais inutilis&eacute; pour l&rsquo;affichage sur les slides.</p>
<p><strong>Titre (sld_title)</strong> : message affich&eacute; sur le slide. Avec TinyMCE il est possible de rendre le titre plus visible sur certains slide.</p>
<p><strong>Description (sld_description)</strong> : Message affich&eacute; sous le titre sur le slide. Avec TinyMCE il est possible de rendre la description plus visible sur certains slide.</p>
<p><strong>En savoir plus (sld_read_more)</strong>&nbsp;: URL accessible sur le bouton affich&eacute; sur le slide. Optionnelle, il permet d&rsquo;acc&eacute;der &agrave; un article ou une page d&rsquo;informations.</p>
<p><strong>Image (sld_image)</strong> : Image du slide. Attention v&eacute;rifiez la taille des fichiers (1920 px x 500 px pour xbootstrap).</p>
<p><strong>Actif (sld_actif)</strong> : <strong>non</strong> = Le slide ne sera jamais afficher. Permet d&rsquo;activer un slide pour une utilisation ult&eacute;rieure sans le supprimer, par exemple pour les f&ecirc;tes r&eacute;currentes.</p>
<p><strong>A une p&eacute;riode (sld_periodicity) </strong>: <strong>non</strong> = le slide est toujours affich&eacute; quel que soit la p&eacute;riode d&rsquo;affichage /&nbsp; <strong>oui</strong> = il faut d&eacute;finir la p&eacute;riode d'affichage.</p>
<p><strong>Date de d&eacute;but (sld_date_begin)</strong> : date et heure de d&eacute;but d'affichage du slide.</p>
<p><strong>Date de fin (sld_date_end)</strong> : date de fin d'affichage du slide.</p>
<p><strong>Poids (sld_weight)</strong> : d&eacute;fini l'ordre d'affichage des slides. Si plusieurs slides ont le m&ecirc;me poids l'ordre alphab&eacute;tique des titres est appliqu&eacute;.</p>
<p><strong>Th&egrave;me&nbsp;(sld_theme)</strong> : Nom du th&egrave;me sur lequel les slide seront affich&eacute;s. Le fichier "tpl/slides.tpl" sera modifi&eacute;.</p>
<p><strong>Traitements</strong></p>
<p>Sur la page d'index plusieurs traitements sont&nbsp; possibles.</p>
<ul type="disc"><li>R&eacute;initialise les fichiers 'tpl/slider.tpl' d'origine de chaque th&egrave;me.<br /> D&eacute;sactive le block du module slider pour permettre l'affichage des slides d'origine<br /> Supprime les caches pour actualiser l'affichage imm&eacute;diatement</li></ul><p>&nbsp;</p>
<ul type="disc"><li>Activer le block qui permet la mise &agrave; jour des slides<br /> Equivaut &agrave; afficher le block dans le gestionnaire de blocks</li></ul><p>&nbsp;</p>
<p><strong>Block =&gt; slider_update_tpl</strong></p>
<p>Quand le block est activ&eacute;, le block modifie le fichier "tpl/slider.tpl" avec les slides qui ont &eacute;t&eacute; ajout&eacute;s.</p>
<p>La mise &agrave; jour n'est effectu&eacute; que dans le cas un des slides a &eacute;t&eacute; modifi&eacute; ajout&eacute; ou supprim&eacute;.<br /> Le fichier d'origine est sauvegard&eacute; avec le le suffixe "-old" =&gt; "tlp/slider-old.tpl"<br /> Il sera r&eacute;install&eacute; lors de la d&eacute;sinstallation du module.</p>
<p>&nbsp;</p>

<p>&nbsp;</p>
